{"format": "graph-model", "generatedBy": "2.20.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"bathrooms:0": {"name": "bathrooms:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "bedrooms:0": {"name": "bedrooms:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "energy_label:0": {"name": "energy_label:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "has_garage:0": {"name": "has_garage:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "has_garden:0": {"name": "has_garden:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "has_terrace:0": {"name": "has_terrace:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "living_area_m2:0": {"name": "living_area_m2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "lot_area_m2:0": {"name": "lot_area_m2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "municipality:0": {"name": "municipality:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "postal_code:0": {"name": "postal_code:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "property_type:0": {"name": "property_type:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "year_built:0": {"name": "year_built:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "unknown_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/living_area_m2_norm_1/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/lot_area_m2_norm_1/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/bedrooms_norm_1/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "unknown_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/bathrooms_norm_1/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "unknown_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/year_built_norm_1/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "unknown_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/has_garden_norm_1/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "unknown_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/has_terrace_norm_1/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_21", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/has_garage_norm_1/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/property_type_onehot_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/property_type_onehot_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/property_type_onehot_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/property_type_onehot_1/one_hot/depth", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/property_type_onehot_1/one_hot/on_value", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/property_type_onehot_1/one_hot/off_value", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/postal_code_onehot_1/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/postal_code_onehot_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/postal_code_onehot_1/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/postal_code_onehot_1/one_hot/depth", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/postal_code_onehot_1/one_hot/on_value", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/postal_code_onehot_1/one_hot/off_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/municipality_onehot_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/municipality_onehot_1/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/municipality_onehot_1/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/municipality_onehot_1/one_hot/depth", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/municipality_onehot_1/one_hot/on_value", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/municipality_onehot_1/one_hot/off_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/energy_label_onehot_1/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/energy_label_onehot_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/energy_label_onehot_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/energy_label_onehot_1/one_hot/depth", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/energy_label_onehot_1/one_hot/on_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/energy_label_onehot_1/one_hot/off_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/concatenate_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2602"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/log_price_pred_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/log_price_pred_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "bathrooms", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "bedrooms", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "energy_label", "op": "Placeholder", "attr": {"dtype": {"type": "DT_STRING"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "has_garage", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "has_garden", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "has_terrace", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "living_area_m2", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "lot_area_m2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "municipality", "op": "Placeholder", "attr": {"dtype": {"type": "DT_STRING"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "postal_code", "op": "Placeholder", "attr": {"dtype": {"type": "DT_STRING"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "property_type", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_STRING"}}}, {"name": "unknown", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "unknown_1", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "unknown_3", "op": "Placeholder", "attr": {"dtype": {"type": "DT_RESOURCE"}, "shape": {"shape": {}}}}, {"name": "unknown_5", "op": "Placeholder", "attr": {"dtype": {"type": "DT_RESOURCE"}, "shape": {"shape": {}}}}, {"name": "year_built", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/functional_1/bathrooms_norm_1/Sub", "op": "Sub", "input": ["bathrooms", "unknown_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/bedrooms_norm_1/Sub", "op": "Sub", "input": ["bedrooms", "unknown_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/has_garage_norm_1/Sub", "op": "Sub", "input": ["has_garage", "unknown_21"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/has_garden_norm_1/Sub", "op": "Sub", "input": ["has_garden", "unknown_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/has_terrace_norm_1/Sub", "op": "Sub", "input": ["has_terrace", "unknown_19"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/living_area_m2_norm_1/Sub", "op": "Sub", "input": ["living_area_m2", "unknown_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lot_area_m2_norm_1/Sub", "op": "Sub", "input": ["lot_area_m2", "unknown_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/energy_label_lookup_1/None_Lookup/LookupTableFindV2", "op": "LookupTableFindV2", "input": ["unknown", "energy_label", "unknown_0"], "attr": {"_has_manual_control_dependencies": {"b": true}, "Tout": {"type": "DT_INT64"}, "Tin": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall/functional_1/municipality_lookup_1/None_Lookup/LookupTableFindV2", "op": "LookupTableFindV2", "input": ["unknown_1", "municipality", "unknown_2"], "attr": {"Tout": {"type": "DT_INT64"}, "Tin": {"type": "DT_STRING"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/postal_code_lookup_1/None_Lookup/LookupTableFindV2", "op": "LookupTableFindV2", "input": ["unknown_3", "postal_code", "unknown_4"], "attr": {"Tin": {"type": "DT_STRING"}, "Tout": {"type": "DT_INT64"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/property_type_lookup_1/None_Lookup/LookupTableFindV2", "op": "LookupTableFindV2", "input": ["unknown_5", "property_type", "unknown_6"], "attr": {"_has_manual_control_dependencies": {"b": true}, "Tout": {"type": "DT_INT64"}, "Tin": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall/functional_1/year_built_norm_1/Sub", "op": "Sub", "input": ["year_built", "unknown_15"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/bathrooms_norm_1/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/bathrooms_norm_1/Sub", "ConstantFolding/StatefulPartitionedCall/functional_1/bathrooms_norm_1/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/bedrooms_norm_1/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/bedrooms_norm_1/Sub", "ConstantFolding/StatefulPartitionedCall/functional_1/bedrooms_norm_1/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/has_garage_norm_1/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/has_garage_norm_1/Sub", "ConstantFolding/StatefulPartitionedCall/functional_1/has_garage_norm_1/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/has_garden_norm_1/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/has_garden_norm_1/Sub", "ConstantFolding/StatefulPartitionedCall/functional_1/has_garden_norm_1/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/has_terrace_norm_1/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/has_terrace_norm_1/Sub", "ConstantFolding/StatefulPartitionedCall/functional_1/has_terrace_norm_1/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/living_area_m2_norm_1/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/living_area_m2_norm_1/Sub", "ConstantFolding/StatefulPartitionedCall/functional_1/living_area_m2_norm_1/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lot_area_m2_norm_1/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/lot_area_m2_norm_1/Sub", "ConstantFolding/StatefulPartitionedCall/functional_1/lot_area_m2_norm_1/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/Cast_3", "op": "Cast", "input": ["StatefulPartitionedCall/functional_1/energy_label_lookup_1/None_Lookup/LookupTableFindV2"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/Cast_2", "op": "Cast", "input": ["StatefulPartitionedCall/functional_1/municipality_lookup_1/None_Lookup/LookupTableFindV2"], "attr": {"DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/functional_1/postal_code_lookup_1/None_Lookup/LookupTableFindV2"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_1/property_type_lookup_1/None_Lookup/LookupTableFindV2"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/year_built_norm_1/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/year_built_norm_1/Sub", "ConstantFolding/StatefulPartitionedCall/functional_1/year_built_norm_1/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/energy_label_onehot_1/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/functional_1/Cast_3"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_1/municipality_onehot_1/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/functional_1/Cast_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_1/postal_code_onehot_1/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/functional_1/Cast_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_1/property_type_onehot_1/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/functional_1/Cast"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_1/energy_label_onehot_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1/energy_label_onehot_1/Shape_1", "StatefulPartitionedCall/functional_1/energy_label_onehot_1/strided_slice_1/stack", "StatefulPartitionedCall/functional_1/energy_label_onehot_1/strided_slice_1/stack_1", "StatefulPartitionedCall/functional_1/energy_label_onehot_1/strided_slice_1/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/municipality_onehot_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1/municipality_onehot_1/Shape_1", "StatefulPartitionedCall/functional_1/municipality_onehot_1/strided_slice_1/stack", "StatefulPartitionedCall/functional_1/municipality_onehot_1/strided_slice_1/stack_1", "StatefulPartitionedCall/functional_1/municipality_onehot_1/strided_slice_1/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/postal_code_onehot_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1/postal_code_onehot_1/Shape_1", "StatefulPartitionedCall/functional_1/postal_code_onehot_1/strided_slice_1/stack", "StatefulPartitionedCall/functional_1/postal_code_onehot_1/strided_slice_1/stack_1", "StatefulPartitionedCall/functional_1/postal_code_onehot_1/strided_slice_1/stack_2"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/property_type_onehot_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1/property_type_onehot_1/Shape_1", "StatefulPartitionedCall/functional_1/property_type_onehot_1/strided_slice_1/stack", "StatefulPartitionedCall/functional_1/property_type_onehot_1/strided_slice_1/stack_1", "StatefulPartitionedCall/functional_1/property_type_onehot_1/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/energy_label_onehot_1/Reshape/shape_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/functional_1/energy_label_onehot_1/strided_slice_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/municipality_onehot_1/Reshape/shape_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/functional_1/municipality_onehot_1/strided_slice_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/postal_code_onehot_1/Reshape/shape_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/functional_1/postal_code_onehot_1/strided_slice_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/property_type_onehot_1/Reshape/shape_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/functional_1/property_type_onehot_1/strided_slice_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/energy_label_onehot_1/Reshape/shape", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_1/energy_label_onehot_1/strided_slice_1", "ConstantFolding/StatefulPartitionedCall/functional_1/energy_label_onehot_1/Reshape/shape_const_axis"], "attr": {"T": {"type": "DT_INT32"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/municipality_onehot_1/Reshape/shape", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_1/municipality_onehot_1/strided_slice_1", "ConstantFolding/StatefulPartitionedCall/functional_1/municipality_onehot_1/Reshape/shape_const_axis"], "attr": {"T": {"type": "DT_INT32"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/postal_code_onehot_1/Reshape/shape", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_1/postal_code_onehot_1/strided_slice_1", "ConstantFolding/StatefulPartitionedCall/functional_1/postal_code_onehot_1/Reshape/shape_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/property_type_onehot_1/Reshape/shape", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_1/property_type_onehot_1/strided_slice_1", "ConstantFolding/StatefulPartitionedCall/functional_1/property_type_onehot_1/Reshape/shape_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/energy_label_onehot_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/Cast_3", "StatefulPartitionedCall/functional_1/energy_label_onehot_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/municipality_onehot_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/Cast_2", "StatefulPartitionedCall/functional_1/municipality_onehot_1/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/postal_code_onehot_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/Cast_1", "StatefulPartitionedCall/functional_1/postal_code_onehot_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/property_type_onehot_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/Cast", "StatefulPartitionedCall/functional_1/property_type_onehot_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/energy_label_onehot_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_1/energy_label_onehot_1/Reshape"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/municipality_onehot_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_1/municipality_onehot_1/Reshape"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/postal_code_onehot_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_1/postal_code_onehot_1/Reshape"], "attr": {"DstT": {"type": "DT_INT64"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/property_type_onehot_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/functional_1/property_type_onehot_1/Reshape"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/functional_1/energy_label_onehot_1/one_hot", "op": "OneHot", "input": ["StatefulPartitionedCall/functional_1/energy_label_onehot_1/Cast", "StatefulPartitionedCall/functional_1/energy_label_onehot_1/one_hot/depth", "StatefulPartitionedCall/functional_1/energy_label_onehot_1/one_hot/on_value", "StatefulPartitionedCall/functional_1/energy_label_onehot_1/one_hot/off_value"], "attr": {"T": {"type": "DT_FLOAT"}, "TI": {"type": "DT_INT64"}, "axis": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/functional_1/municipality_onehot_1/one_hot", "op": "OneHot", "input": ["StatefulPartitionedCall/functional_1/municipality_onehot_1/Cast", "StatefulPartitionedCall/functional_1/municipality_onehot_1/one_hot/depth", "StatefulPartitionedCall/functional_1/municipality_onehot_1/one_hot/on_value", "StatefulPartitionedCall/functional_1/municipality_onehot_1/one_hot/off_value"], "attr": {"T": {"type": "DT_FLOAT"}, "TI": {"type": "DT_INT64"}, "axis": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/functional_1/postal_code_onehot_1/one_hot", "op": "OneHot", "input": ["StatefulPartitionedCall/functional_1/postal_code_onehot_1/Cast", "StatefulPartitionedCall/functional_1/postal_code_onehot_1/one_hot/depth", "StatefulPartitionedCall/functional_1/postal_code_onehot_1/one_hot/on_value", "StatefulPartitionedCall/functional_1/postal_code_onehot_1/one_hot/off_value"], "attr": {"axis": {"i": "-1"}, "TI": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/property_type_onehot_1/one_hot", "op": "OneHot", "input": ["StatefulPartitionedCall/functional_1/property_type_onehot_1/Cast", "StatefulPartitionedCall/functional_1/property_type_onehot_1/one_hot/depth", "StatefulPartitionedCall/functional_1/property_type_onehot_1/one_hot/on_value", "StatefulPartitionedCall/functional_1/property_type_onehot_1/one_hot/off_value"], "attr": {"axis": {"i": "-1"}, "TI": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/concatenate_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_1/living_area_m2_norm_1/truediv", "StatefulPartitionedCall/functional_1/lot_area_m2_norm_1/truediv", "StatefulPartitionedCall/functional_1/bedrooms_norm_1/truediv", "StatefulPartitionedCall/functional_1/bathrooms_norm_1/truediv", "StatefulPartitionedCall/functional_1/year_built_norm_1/truediv", "StatefulPartitionedCall/functional_1/has_garden_norm_1/truediv", "StatefulPartitionedCall/functional_1/has_terrace_norm_1/truediv", "StatefulPartitionedCall/functional_1/has_garage_norm_1/truediv", "StatefulPartitionedCall/functional_1/property_type_onehot_1/one_hot", "StatefulPartitionedCall/functional_1/postal_code_onehot_1/one_hot", "StatefulPartitionedCall/functional_1/municipality_onehot_1/one_hot", "StatefulPartitionedCall/functional_1/energy_label_onehot_1/one_hot", "StatefulPartitionedCall/functional_1/concatenate_1/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "12"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1/concatenate_1/concat", "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "2602"}]}, {"dim": [{"size": "2602"}, {"size": "128"}]}]}}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1/dense_1/Relu", "StatefulPartitionedCall/functional_1/dense_1_2/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}]}, {"dim": [{"size": "128"}, {"size": "64"}]}]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1/dense_1_2/Relu", "StatefulPartitionedCall/functional_1/dense_2_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "64"}]}, {"dim": [{"size": "64"}, {"size": "32"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/functional_1/log_price_pred_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_1/dense_2_1/Relu", "StatefulPartitionedCall/functional_1/log_price_pred_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "32"}]}, {"dim": [{"size": "32"}, {"size": "1"}]}]}}}}, {"name": "StatefulPartitionedCall/functional_1/log_price_pred_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/log_price_pred_1/MatMul", "StatefulPartitionedCall/functional_1/log_price_pred_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_1/log_price_pred_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown_7", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/living_area_m2_norm_1/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "unknown_9", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/lot_area_m2_norm_1/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "unknown_11", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/bedrooms_norm_1/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "unknown_13", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/bathrooms_norm_1/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "unknown_15", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/year_built_norm_1/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "unknown_17", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/has_garden_norm_1/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "unknown_19", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/has_terrace_norm_1/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "unknown_21", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/has_garage_norm_1/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "unknown_6", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/property_type_onehot_1/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/property_type_onehot_1/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/property_type_onehot_1/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/property_type_onehot_1/one_hot/depth", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/property_type_onehot_1/one_hot/on_value", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/property_type_onehot_1/one_hot/off_value", "shape": [], "dtype": "float32"}, {"name": "unknown_4", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/postal_code_onehot_1/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/postal_code_onehot_1/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/postal_code_onehot_1/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/postal_code_onehot_1/one_hot/depth", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/postal_code_onehot_1/one_hot/on_value", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/postal_code_onehot_1/one_hot/off_value", "shape": [], "dtype": "float32"}, {"name": "unknown_2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/municipality_onehot_1/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/municipality_onehot_1/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/municipality_onehot_1/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/municipality_onehot_1/one_hot/depth", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/municipality_onehot_1/one_hot/on_value", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/municipality_onehot_1/one_hot/off_value", "shape": [], "dtype": "float32"}, {"name": "unknown_0", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/energy_label_onehot_1/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/energy_label_onehot_1/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/energy_label_onehot_1/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/energy_label_onehot_1/one_hot/depth", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/energy_label_onehot_1/one_hot/on_value", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/energy_label_onehot_1/one_hot/off_value", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/concatenate_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp", "shape": [2602, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/Cast/ReadVariableOp", "shape": [128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/Cast/ReadVariableOp", "shape": [64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/log_price_pred_1/Cast/ReadVariableOp", "shape": [32, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/log_price_pred_1/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/energy_label_onehot_1/Reshape/shape_const_axis", "shape": [], "dtype": "int32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/municipality_onehot_1/Reshape/shape_const_axis", "shape": [], "dtype": "int32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/postal_code_onehot_1/Reshape/shape_const_axis", "shape": [], "dtype": "int32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/property_type_onehot_1/Reshape/shape_const_axis", "shape": [], "dtype": "int32"}]}]}